app/views/pledges/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category %><br />
    <%= f.collection_select(:category_id, Category.all, :id, :name, prompt: true) %>

SELECT "users".* FROM "users"
---
    <%= f.label :sponsor_id %><br />
    <%= f.collection_select(:sponsor_id, User.where.not(id: current_user.id), :id, :username, prompt: true) %>