app/views/users/show.html.erb

SELECT "pledges".* FROM "pledges" WHERE "pledges"."user_id" = $1  [["user_id", 1]]
---

  <% @user.pledges.each do |pledge| %>