app/controllers/pledges_controller.rb

  def index
    @pledges = Pledge.all
---
SELECT "pledges".* FROM "pledges"

  def show
    @pledge = Pledge.find(params[:id])
---
SELECT  "pledges".* FROM "pledges" WHERE "pledges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @pledge = Pledge.find(params[:id])
---
SELECT  "pledges".* FROM "pledges" WHERE "pledges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @pledge = current_user.pledges.create(pledge_params)
    @user = current_user

    respond_to do |format|
      if @pledge.save
---
INSERT INTO "pledges" ("name", "description", "amount", "user_id", "category_id", "created_at", "updated_at", "sponsor_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "users" SET "coins" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["coins", 10], ["updated_at", 2016-08-11 17:42:55 UTC], ["id", 2]]

  def update
    @pledge = Pledge.find(params[:id])
    @user = current_user

    p pledge_params

    if @pledge.update(pledge_params)
---
SELECT  "pledges".* FROM "pledges" WHERE "pledges"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "pledges" SET "name" = $1, "updated_at" = $2 WHERE "pledges"."id" = $3  [["name", "3,000 sit ups"], ["updated_at", 2016-08-08 11:01:13 UTC], ["id", 2]]

  def destroy
    @user = current_user
    @pledge = Pledge.find(params[:id])
    @pledge.destroy
---
SELECT  "pledges".* FROM "pledges" WHERE "pledges"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "pledges" WHERE "pledges"."id" = $1  [["id", 3]]

  def checkin
    @pledge = Pledge.find(params[:id])

    @pledge.first_checkin

    if @pledge.is_failed?
      ## pledge is over!
      flash[:danger] = "Pledge failed!"
    else
      @pledge.update(daily_post: Time.now.utc)
---
SELECT  "pledges".* FROM "pledges" WHERE "pledges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pledges" SET "daily_post" = $1, "updated_at" = $2 WHERE "pledges"."id" = $3  [["daily_post", Tue, 09 Aug 2016], ["updated_at", 2016-08-09 14:05:03 UTC], ["id", 1]]